SE_feedback.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:name="ariyo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sub="http://SubscriptionEngine.ibm.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sub:notificationToCP>
         <notificationRespDTO>
            <xactionId>0</xactionId>
            <errorCode>1</errorCode>
            <errorMsg>Success</errorMsg>
            <temp1>33</temp1>
            <temp2>0</temp2>
            <temp3>0</temp3>
            <lowBalance>0.0</lowBalance>
            <amount>1.0</amount>
            <chargigTime>2011-10-04T15:45:40.890Z</chargigTime>
            <msisdn>9999999999</msisdn>
            <productId>111</productId>
         </notificationRespDTO>
      </sub:notificationToCP>
   </soapenv:Body>
</soapenv:Envelope>